
import Functional


## вычислить число c заданной точностью d
Functional.pi_precision()

## задайте натуральное число n. напишите программу, которая составит список простых множителей числа n.
Functional.is_a_factor_of_N()

## задайте последовательность чисел. напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

result = Functional.non_repeating_numbers(23, 34, 556, 100, 11, 34, 556)
print("Cписок неповторяющихся элементов:", result)